app/controllers/brands_controller.rb

  def index
    @brands = Brand.all
---
SELECT "brands".* FROM "brands"

  def create
    @brand = Brand.new(brand_params)

    respond_to do |format|
      if @brand.save
---
INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Air Max 90"], ["created_at", "2017-05-05 17:21:14.432138"], ["updated_at", "2017-05-05 17:21:14.432138"]]

  def update
    respond_to do |format|
      if @brand.update(brand_params)
---
UPDATE "brands" SET "brandlogo" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["brandlogo", "Adidas-Logo-880x660.png"], ["updated_at", "2017-05-05 15:43:03.899256"], ["id", 15]]

  def destroy
    @brand.destroy
---
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 1]]

    def set_brand
      @brand = Brand.find(params[:id])
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]