app/controllers/sneakers_controller.rb

  def index
    @sneakers = Sneaker.all
---
SELECT "sneakers".* FROM "sneakers"

  def create
    @sneaker = Sneaker.new(sneaker_params)

    respond_to do |format|
      if @sneaker.save
---
INSERT INTO "sneakers" ("name", "brand_id", "price", "size", "sex", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Tupac"], ["brand_id", "20"], ["price", "$99.00"], ["size", "11"], ["sex", "Men"], ["created_at", "2017-05-05 13:50:21.899593"], ["updated_at", "2017-05-05 13:50:21.899593"]]

  def destroy
    @sneaker.destroy
---
DELETE FROM "sneakers" WHERE "sneakers"."id" = ?  [["id", 1]]

    def set_sneaker
      @sneaker = Sneaker.find(params[:id])
---
SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]