app/views/sneakers/_form.html.erb

      <%#= form.text_field :brand_id, id: :sneaker_brand_id %>
      <%= select("sneaker", "brand_id", Brand.all.collect {|a| [ a.name, a.id ] }, { include_blank: true }) %>
---
SELECT "brands".* FROM "brands"
SELECT "sneakers".* FROM "sneakers" WHERE "sneakers"."brand_id" = ?  [["brand_id", "15"]]